diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)) КАК СуммаДней
        |ПОМЕСТИТЬ ВТ_КоличествоДней
        |ИЗ
        |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |ГДЕ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
        |	ВТ_КоличествоДней.СуммаДней КАК СуммаДней
        |ИЗ
        |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоДней КАК ВТ_КоличествоДней
        |		ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВТ_КоличествоДней.Сотрудник
        |ГДЕ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    РезультатЗапроса = Запрос.Выполнить().Выгрузить();
     
    ОтпускаСотрудников.Загрузить(РезультатЗапроса);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти


#КонецЕсли
